[
  {
    "title": "Golang developer (Remote consultant)",
    "company": "Xiatech (London, UK)",
    "date": "2019 March - present",
    "message": "Data analysis of business information. Creating data ingest pipelines, data processing, analysis and persistence in data lakes. Technologies used: Golang, AWS Lambda, AWS DynamoDB, AWS DMS, TDD, Docker, Terraform, SQL"
  },
  {
    "title": "Principal Software Engineer (Remote consultant)",
    "company": "Rokkex (Vilnius, LT)",
    "date": "2018 Aug - present",
    "message": "Core contributor to high performance matching engine written in GO using TDD process (unit, integration and benchmark tests) as well as development of microservices with Node.js and client facing app with React.js. Technologies used: Golang, Grpc, Kafka, Docker, Node.js, React.js, Jest"
  },
  {
    "title": "Senior / Principal Software Engineer (Remote consultant)",
    "company": "Hostmaker (London, UK)",
    "date": "2017 Jan - present",
    "message": "Working on various projects starting from utility Slack bots with AWS Lambda integration (Golang), API (using Node.js with Sequelize), multiple client facing apps (React, Ember, vanilla JS) and mobile app (React Native). Focusing on delivering clean and maintainable code with high test coverage. Involved in hiring process, code reviews and mentoring junior developers."
  },
  {
    "title": "Senior Front End Developer (Remote consultant)",
    "company": "Wrap Media (San Francisco, USA)",
    "date": "2015 Feb - 2016 Nov",
    "message": "Building powerful mobile engagement tool for deepening relationships, improving loyalty and driving commerce. Daily tasks involved development of API and client side apps using RoR and Angularjs"
  },
  {
    "title": "Long Term Consultant / Senior Front End Developer (Remote consultant)",
    "company": "SameSystem A/S (Denmark)",
    "date": "2014 Feb - 2017 Jan",
    "message": "Developed the mobile app from scratch for retail efficiency management system. Using cordova/React native."
  },
  {
    "title": "Front End Developer",
    "company": "Necolt (Vilnius, LT)",
    "date": "2013 April - 2014 February",
    "message": "Worked on various projects with different technologies such as: RoR, node.js, backbone.js and more."
  },
  {
    "title": "Full Stack Software Developer",
    "company": "Little Star Media Ltd. (Milton Keynes, UK)",
    "date": "2010 August - 2013 April",
    "message": "Worked with large scale SOA architecture with RoR, Node.js and Backbone.js. Developing responsive web app and games."
  }
]
